class Users:
    user_1 = {
        "name": "Марья",
        "surname": "Счастливая",
        "address": "Звездная Планета",
        "subway": "Сокольники",
        "phone": "89999999998",
        "date": "10.10.2025",
        "rent_days_option": "сутки", 
        "color": "черный жемчуг",
        "comment": "мчись быстрее ветра"
    }

    user_2 = {
        "name": "Святозар",
        "surname": "Солнцев",
        "address": "Красивый Дом",
        "subway": "Сокол",
        "phone": "89997777777",
        "date": "13.10.2025",
        "rent_days_option": "двое суток", 
        "color": "серая безысходность",
        "comment": "no comments"
    }

class FAQ:
    expected_texts = [
        "Сутки — 400 рублей. Оплата курьеру — наличными или картой.",
        "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.",
        "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.",
        "Только начиная с завтрашнего дня. Но скоро станем расторопнее.",
        "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.",
        "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.",
        "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.",
        "Да, обязательно. Всем самокатов! И Москве, и Московской области."
    ]
       

        
    




